Repository: mozilla-l10n/mt-training-data
Catalog: sat/sat_pontoon.tmx
Source language: en_us
Languages: sat

source: <p>This web page at %1$s has been reported as a deceptive site and has been blocked based on your security preferences.</p>
sat: <p>%1$s ᱨᱮ ᱢᱮᱱᱟᱜ ᱥᱟᱭᱤᱴ ᱫᱚ ᱠᱷᱟᱹᱛᱨᱟ ᱟᱨ ᱮᱲᱮ ᱜᱮᱭᱟ ᱢᱮᱱᱛᱮ ᱠᱚ ᱠᱷᱚᱵᱚᱨ ᱟᱠᱟᱫᱼᱟ ᱟᱨ ᱟᱢᱟᱜ ᱥᱮᱠᱭᱚᱨᱟᱹᱴᱭ ᱯᱨᱤᱯᱷᱮᱨᱮᱱᱥ ᱦᱤᱥᱟᱹᱵ ᱛᱮ ᱵᱞᱚᱠ ᱟᱠᱟᱱᱟ ᱾</p>

source: Pull to refresh
sat: ᱱᱟᱶᱟ ᱟᱹᱨᱩ ᱞᱟᱹᱜᱤᱛ ᱛᱮ ᱚᱨ ᱢᱮ

source: QR scanner
sat: QR ᱥᱠᱮᱱᱚᱨ

source: Quick settings sheet
sat: ᱞᱚᱜᱚᱱ ᱥᱟᱡᱟᱣ ᱥᱤᱤᱴ

source: Quit
sat: ᱟᱲᱟᱹᱜ ᱢᱮ

source: Rate on Google Play
sat: Google Play ᱨᱮ ᱫᱚᱨ ᱢᱮ

source: Rating
sat: ᱫᱚᱨ ᱴᱷᱟᱣᱠᱟ

source: Read and modify bookmarks
sat: ᱵᱩᱠᱢᱟᱨᱠ ᱠᱚ ᱯᱟᱹᱲᱦᱟᱣ ᱢᱮ ᱟᱨ ᱵᱚᱫᱚᱞ ᱢᱮ

source: Read and modify browser settings
sat: ᱵᱨᱟᱩᱡᱟᱹᱨ ᱥᱟᱡᱚᱣ ᱠᱚ ᱯᱟᱹᱲᱦᱟᱣ ᱢᱮ ᱟᱨ ᱵᱚᱫᱚᱞ ᱢᱮ

source: Read and modify privacy settings
sat: ᱱᱤᱥᱚᱱ ᱥᱟᱡᱟᱣ ᱠᱚ ᱯᱟᱲᱦᱟᱣ ᱢᱮ ᱟᱨ ᱵᱚᱫᱚᱞ ᱢᱮ

source: Reader view
sat: ᱨᱤᱰᱚᱨ ᱵᱷᱭᱩ

source: Reading List
sat: ᱯᱟᱲᱦᱟᱣ ᱞᱤᱥᱴᱤ

source: Read our privacy notice
sat: ᱟᱞᱮᱭᱟᱜ ᱱᱤᱥᱚᱱ ᱱᱚᱴᱤᱥ ᱯᱟᱲᱦᱟᱣ ᱯᱮ

source: Read the text of all open tabs
sat: ᱥᱟᱱᱟᱢ ᱡᱷᱤᱡ ᱴᱮᱵ ᱠᱚᱣᱟᱜ ᱚᱱᱚᱞ ᱯᱟᱲᱦᱟᱣ ᱢᱮ

source: Ready to scan
sat: ᱥᱠᱮᱱ ᱞᱚᱜᱤᱛ ᱛᱮ ᱛᱮᱭᱟᱨ ᱢᱮᱱᱟᱢ-ᱟ

source: Rear-facing camera
sat: ᱛᱟᱭᱚᱢ ᱠᱮᱢᱨᱟ

source: Received tabs
sat: ᱧᱟᱢᱟᱠᱟᱱ ᱴᱮᱵ ᱠᱚ

source: Recently closed tabs
sat: ᱱᱤᱛᱚᱜᱽᱼᱟᱜ ᱵᱚᱸᱫᱚᱼᱟᱜ ᱴᱮᱵ ᱠᱚ

source: Recently used
sat: ᱱᱤᱛᱚᱜ ᱵᱮᱵᱷᱟᱨᱟᱜ

source: Recommended
sat: ᱵᱟᱛᱟᱣᱟᱜ

source: Reconnect
sat: ᱨᱤᱠᱚᱱᱮᱠᱼᱴ

source: Reconnect to resume syncing
sat: ᱥᱭᱸᱠ ᱠᱚ ᱪᱟᱹᱞᱩ ᱫᱚᱦᱚ ᱞᱟᱹᱜᱤᱫ ᱫᱩᱦᱲᱟᱹ ᱡᱩᱰᱟᱹᱣ

source: Reconnect to Sync
sat: ᱥᱭᱸᱠ ᱞᱟᱹᱜᱤᱫ ᱫᱩᱦᱲᱟᱹ ᱡᱩᱲᱟᱹᱣ

source: Redirect Trackers
sat: ᱨᱤᱰᱭᱨᱮᱠᱼᱴ ᱯᱟᱧᱡᱟ ᱫᱟᱱᱟᱲ ᱠᱚ

source: Re-enter your PIN
sat: PIN ᱫᱩᱦᱲᱟᱹ ᱟᱫᱮᱨ ᱢᱮ

source: Refresh
sat: ᱨᱤᱯᱷᱨᱮᱥ

source: Refreshing this page could duplicate recent actions, such as sending a payment or posting a comment twice.
sat: ᱥᱟᱦᱴᱟ ᱨᱤᱯᱷᱨᱮᱥ ᱞᱮᱠᱷᱟᱱ ᱱᱤᱛᱚᱜᱟᱜ ᱠᱟᱹᱢᱤ ᱠᱚ ᱰᱩᱯᱞᱤᱠᱮᱴ ᱫᱟᱲᱮᱭᱟᱜᱼᱟᱭ, ᱡᱮᱢᱚᱱ ᱯᱩᱭᱥᱟᱹ ᱵᱷᱮᱡᱟ ᱠᱚ ᱟᱨ ᱵᱟᱝ ᱠᱚᱢᱮᱴ ᱠᱚ ᱵᱟᱨ ᱡᱮᱠᱷᱟ ᱵᱷᱮᱡᱟ ᱠᱚ ᱾

source: Reload
sat: ᱫᱚᱦᱲᱟ ᱞᱟᱫᱤ

source: Remember decision for this site
sat: ᱱᱤᱥᱴᱟᱹ ᱫᱤᱥᱚᱸ ᱫᱚᱦᱚᱭ ᱢᱮ ᱱᱚᱶᱟ ᱥᱟᱭᱤᱴ ᱞᱟᱹᱜᱤᱫ

source: Remote debugging via USB
sat: ᱥᱟᱸᱜᱤᱧ ᱫᱚᱥ ᱥᱟᱦᱟᱭ USB ᱥᱟᱶ ᱛᱮ

source: Remove
sat: ᱚᱪᱚᱜ ᱢᱮ

source: Remove account
sat: ᱠᱷᱟᱛᱟ ᱚᱪᱚᱜ ᱢᱮ

source: Removed %1$s
sat: %1$s ᱚᱪᱚᱜᱮᱱᱟ

source: Remove tab from collection
sat: ᱴᱮᱵ ᱛᱩᱢᱟᱹᱞ ᱠᱷᱚᱱ ᱚᱪᱚᱜ ᱢᱮ

source: Rename
sat: ᱨᱤᱱᱮᱢ

source: Rename collection
sat: ᱛᱩᱢᱟᱹᱞ ᱫᱚᱦᱲᱟ ᱧᱩᱛᱩᱢ ᱢᱮ

# Replace query with “%s”. Example: https://www.google.com/search?q=%s
source: Replace query with “%s”. Example:\nhttps://www.google.com/search?q=%s
sat: “%s” ᱥᱟᱞᱟᱜ ᱠᱣᱮᱨᱭ ᱵᱚᱫᱚᱞ ᱢᱮ ᱾ ᱡᱮᱢᱚᱱ:\nhttps://www.google.com/search?q=%s

source: Report
sat: ᱨᱤᱯᱚᱴ

source: Resend data
sat: ᱰᱟᱴᱟ ᱫᱩᱦᱲᱟ ᱵᱷᱮᱡᱟᱭᱢᱮ

source: Resend data to this site?
sat: ᱱᱚᱶᱟ ᱥᱟᱭᱤᱴ ᱞᱟᱹᱜᱤᱫ ᱰᱟᱴᱟ ᱫᱩᱦᱲᱟᱹ ᱵᱷᱮᱡᱟᱭ ᱟᱢ‌ ᱥᱮ?

source: Restart %1$s
sat: %1$s ᱫᱩᱦᱲᱟᱹ ᱮᱦᱚᱵᱽ ᱢᱮ

source: Restore tab
sat: ᱴᱮᱵ ᱫᱩᱦᱲᱟᱹ ᱡᱚᱜᱟᱣ ᱢᱮ

source: Resume
sat: ᱫᱩᱦᱲᱟᱹ ᱮᱦᱚᱵᱽ

source: Resync
sat: ᱨᱤᱥᱤᱸᱠ

source: RETRY
sat: ᱨᱤᱴᱨᱭ

source: Return to previous app
sat: ᱞᱟᱦᱟ ᱛᱮᱭᱟᱜ ᱮᱯ ᱨᱮ ᱨᱩᱟᱹᱲᱚᱜ ᱢᱮ

source: Reviews: %1$s
sat: ᱨᱤᱵᱷᱤᱭᱩᱡ ᱠᱚ: %1$s

source: Run in private browsing
sat: ᱱᱤᱡᱚᱨᱟᱜ ᱵᱨᱟᱩᱡᱤᱝ ᱨᱮ ᱪᱟᱹᱞᱩᱭ ᱢᱮ

source: Sans serif
sat: ᱥᱮᱱᱥ ᱥᱮᱨᱤᱯᱷ

source: Sans Serif font
sat: ᱥᱮᱱᱥ ᱥᱮᱨᱤᱯᱷ ᱪᱤᱠᱤ

source: Save
sat: ᱥᱟᱸᱪᱟᱣ ᱢᱮ

source: Save changes to login.
sat: ᱞᱚᱜᱤᱱ ᱵᱚᱫᱚᱞ ᱠᱚ ᱥᱟᱸᱪᱟᱣ ᱢᱮ ᱾

source: Saved logins
sat: ᱥᱟᱸᱪᱟᱣᱠᱟᱱ ᱞᱚᱜᱤᱱ ᱠᱚ

source: Saved %s
sat: %s ᱥᱟᱸᱪᱟᱣᱮᱱᱟ

source: Save file to device
sat: ᱨᱮᱫ ᱥᱟᱫᱷᱚᱱ ᱨᱮ ᱥᱟᱸᱪᱟᱣ ᱢᱮ

source: Save image
sat: ᱪᱤᱛᱟᱹᱨ ᱥᱟᱸᱪᱟᱣ ᱢᱮ

source: Save logins and passwords
sat: ᱞᱚᱜᱤᱱ ᱠᱚ ᱟᱨ ᱫᱟᱱᱟᱝ ᱥᱟᱵᱟᱫ ᱠᱚ ᱥᱟᱸᱪᱟᱣ ᱢᱮ

source: Save selected tabs to collection
sat: ᱵᱟᱪᱷᱟᱣᱠᱟᱱ ᱴᱮᱵ ᱠᱚ ᱛᱩᱢᱟᱹᱞ ᱥᱟᱸᱪᱟᱣ ᱢᱮ

source: Save some battery and your eyesight by enabling dark mode.
sat: ᱛᱤᱱᱟᱹᱜ ᱜᱟᱱ ᱵᱮᱴᱨᱭ ᱵᱚᱪᱚᱛ ᱢᱮ ᱟᱨ ᱟᱢᱟᱜ ᱢᱮᱫ ᱵᱟᱸᱪᱟᱣ ᱛᱟᱢ ᱧᱩᱛ ᱩᱭᱦᱟᱹᱨ ᱪᱟᱹᱞᱩ ᱠᱟᱛᱮ ᱾

source: Save tabs to collection
sat: ᱴᱮᱵ ᱠᱚ ᱛᱩᱢᱟᱹᱞ ᱨᱮ ᱥᱟᱸᱪᱟᱣ ᱢᱮ

source: Save this login?
sat: ᱱᱚᱶᱟ ᱞᱚᱜᱤᱱ ᱥᱟᱸᱪᱟᱣ ᱢᱮ?

source: Save to collection
sat: ᱛᱩᱢᱟᱹᱞ ᱨᱮ ᱥᱟᱸᱪᱟᱣ ᱢᱮ

source: Scan
sat: ᱥᱠᱮᱱ

source: Scan pairing code in desktop Firefox
sat: ᱡᱚᱲᱟᱣ ᱠᱳᱰ ᱥᱠᱮᱱ ᱢᱮ ᱰᱮᱥᱠᱴᱚᱯ Firefox ᱨᱮ

source: Scan the code
sat: ᱠᱳᱰ ᱥᱠᱮᱱ ᱢᱮ

source: Scan the QR code shown at <b>firefox.com/pair</b>
sat: QR ᱠᱳᱰ ᱥᱠᱮᱱ ᱢᱮ ᱡᱟ <b>firefox.com/pair</b> ᱨᱮ ᱩᱫᱩᱠ ᱠᱟᱫᱟ ᱠᱚ

source: Screenshots
sat: ᱤᱥᱠᱨᱤᱱᱥᱚᱴ ᱠᱚ

source: Scroll to hide toolbar
sat: ᱦᱟᱹᱛᱤᱭᱟᱹᱨ ᱩᱠᱩ ᱞᱟᱹᱜᱤᱛ ᱛᱮ ᱛᱚᱛᱨᱚᱭ ᱢᱮ

source: Search
sat: ᱥᱮᱸᱫᱽᱨᱟ

source: Search bookmarks
sat: ᱵᱩᱠᱢᱟᱨᱠ ᱠᱚ ᱥᱮᱸᱫᱽᱨᱟᱭ ᱢᱮ

source: Search browsing history
sat: ᱵᱨᱟᱩᱡᱤᱝ ᱦᱤᱛᱟᱹᱞ ᱥᱮᱸᱫᱽᱨᱟᱭ ᱢᱮ

source: Search engine
sat: ᱥᱮᱸᱫᱽᱨᱟ ᱤᱱᱡᱤᱱ

source: Search engine settings
sat: ᱥᱮᱸᱫᱽᱨᱟᱭ ᱤᱱᱡᱤᱱ ᱥᱟᱡᱟᱣ ᱠᱚ

source: Search engine with name “%s” already exists.
sat: “%s” ᱧᱩᱛᱩᱢ ᱛᱮ ᱢᱟᱲᱟᱝ ᱠᱷᱚᱱ ᱥᱮᱸᱫᱽᱨᱟ ᱤᱸᱡᱤᱱ ᱢᱮᱱᱟᱜᱼᱟ ᱾

source: Search language
sat: ᱯᱟᱹᱨᱥᱤ ᱥᱮᱸᱫᱽᱨᱟᱭ ᱢᱮ

source: Search logins
sat: ᱞᱚᱜᱤᱱ ᱠᱚ ᱥᱮᱸᱫᱽᱨᱟᱭ ᱢᱮ

source: Search or enter address
sat: ᱥᱮᱸᱫᱽᱨᱟ ᱵᱟᱝᱠᱷᱟᱱ ᱴᱷᱤᱠᱟᱹᱬᱟ ᱟᱫᱮᱨ

source: Search string to use
sat: ᱵᱮᱵᱷᱟᱨ ᱞᱟᱹᱜᱤᱫ ᱥᱴᱨᱭᱸᱜ ᱥᱮᱸᱫᱽᱨᱟᱭ ᱢᱮ

source: Search synced tabs
sat: ᱥᱭᱸᱠ ᱟᱠᱟᱱ ᱴᱮᱵ ᱠᱚ ᱥᱮᱸᱫᱽᱨᱟᱭ ᱢᱮ

source: Search the web
sat: ᱣᱮᱵ ᱨᱮ ᱥᱮᱸᱫᱽᱨᱟᱭ ᱢᱮ

source: Secure Connection
sat: ᱡᱟᱯᱛᱤ ᱡᱚᱱᱚᱲᱟᱣ

source: Secure Connection Failed
sat: ᱡᱟᱯᱛᱤ ᱡᱚᱱᱚᱲᱟᱣ ᱦᱩᱲᱟᱹᱜ

source: Secure your logins and passwords
sat: ᱟᱢᱟᱜ ᱞᱚᱜᱤᱱ ᱠᱚ ᱟᱨ ᱫᱟᱱᱟᱝ ᱥᱟᱵᱟᱫ ᱠᱚ ᱡᱟᱯᱛᱤ ᱢᱮ

source: See what’s new
sat: ᱧᱮᱞ ᱢᱮ ᱪᱮᱫ ᱱᱟᱶᱟ ᱢᱮᱱᱟᱜ-ᱟ

source: Select
sat: ᱵᱟᱪᱷᱟᱣ ᱢᱮ

source: Select all
sat: ᱡᱚᱛᱚ ᱠᱚ ᱵᱟᱪᱷᱟᱣ ᱢᱮ

source: Select collection
sat: ᱛᱩᱢᱟᱹᱞ ᱵᱟᱪᱷᱟᱣ ᱢᱮ

source: Selected
sat: ᱵᱟᱪᱷᱟᱣᱮᱱᱟ

source: Selected %1$s
sat: ᱵᱟᱪᱷᱟᱣᱮᱱᱟ %1$s

source: Selected language
sat: ᱵᱟᱪᱷᱟᱣᱟᱠᱟᱱ ᱯᱟᱹᱨᱥᱤ

source: Selected tabs menu
sat: ᱵᱟᱪᱷᱟᱣ ᱟᱠᱟᱱ ᱴᱮᱵ ᱢᱮᱱᱭᱩ ᱠᱚ

source: Select folder
sat: ᱯᱚᱴᱚᱢ ᱵᱟᱪᱷᱟᱣ ᱢᱮ

source: Select tabs
sat: ᱴᱮᱵ ᱠᱚ ᱵᱟᱪᱷᱟᱣ ᱢᱮ

source: Select Tabs
sat: ᱴᱮᱵ ᱠᱚ ᱵᱟᱪᱷᱟᱣ ᱢᱮ

source: Select tabs to save
sat: ᱥᱟᱸᱪᱟᱣ ᱞᱟᱹᱜᱤᱛ ᱛᱮ ᱴᱮᱵ ᱠᱚ ᱵᱟᱪᱷᱟᱣ ᱢᱮ

source: Send and Share
sat: ᱠᱩᱞᱢᱮ ᱟᱨ ᱦᱟᱹᱴᱤᱧ ᱢᱮ

source: Send crash report to %1$s
sat: %1$s ᱴᱷᱮᱱ ᱨᱟᱹᱯᱩᱫ ᱨᱤᱯᱚᱨᱴ ᱠᱩᱞ ᱢᱮ

source: Send crash report to Mozilla
sat: ᱨᱟᱹᱯᱩᱫ ᱨᱤᱯᱚᱴ Mozilla ᱴᱷᱮᱱ ᱠᱩᱞ ᱢᱮ

source: Sending crash report to %1$s
sat: %1$s ᱴᱷᱮᱱ ᱨᱟᱹᱯᱩᱫ ᱨᱤᱯᱚᱴ ᱠᱩᱞ ᱦᱩᱭᱩ ᱠᱟᱱᱟ

source: Send to all devices
sat: ᱡᱚᱛᱚ ᱥᱟᱫᱷᱚᱱ ᱛᱮ ᱵᱷᱮᱡᱟᱭᱢᱮ

source: Send to device
sat: ᱥᱟᱫᱷᱚᱱ ᱨᱮ ᱠᱩᱞ ᱢᱮ

source: Sep
sat: ᱵᱷᱟ

source: Sepia
sat: ᱥᱮᱯᱤᱭᱟ

source: Sepia color scheme
sat: ᱥᱮᱯᱤᱭᱟ ᱨᱚᱝ ᱯᱚᱱᱛᱷᱟ

source: Serif
sat: ᱥᱮᱨᱤᱯᱷ

source: Serif font
sat: ᱥᱮᱨᱤᱯᱷ ᱪᱤᱠᱤ

source: Session options
sat: ᱚᱠᱛᱚ ᱨᱮᱭᱟᱜ ᱚᱯᱥᱚᱱ

source: Sessions
sat: ᱚᱠᱛᱚ ᱠᱚ

source: Set
sat: ᱥᱟᱡᱟᱣ ᱢᱮ

source: Set as default browser
sat: ᱢᱩᱞ ᱵᱨᱟᱩᱡᱟᱹᱨ ᱞᱮᱠᱷᱟ ᱥᱟᱡᱟᱣ ᱢᱮ

source: Set by Battery Saver
sat: ᱵᱮᱴᱨᱭ ᱥᱮᱣᱟᱹᱨ ᱛᱮ ᱥᱮᱴ ᱢᱮ

source: Set open tabs to close automatically that haven’t been viewed in the past day, week, or month.
sat: ᱚᱠᱟ ᱠᱚ ᱫᱚ ᱢᱟᱲᱟᱝ ᱫᱤᱱ, ᱦᱟᱴ, ᱟᱨ ᱵᱟᱝ ᱢᱟᱦᱟ ᱠᱚᱨᱮ ᱵᱟᱝ ᱧᱮᱞ ᱟᱠᱟᱱᱟ ᱚᱱᱟ ᱠᱚ ᱫᱚ ᱠᱷᱭᱞᱟᱹ ᱴᱮᱵ ᱠᱚ ᱨᱮ ᱟᱡ ᱛᱮᱜᱮ ᱵᱚᱸᱫᱚᱜ ᱢᱟ ᱾

source: Settings
sat: ᱥᱟᱡᱟᱣ ᱠᱚ

source: Set up a device lock pattern, PIN, or password to protect your saved logins and passwords from being accessed if someone else has your device.
sat: ᱥᱟᱫᱷᱚᱱ ᱠᱩᱞᱩᱯ ᱪᱤᱱᱦᱟᱹ, ᱯᱤᱱ, ᱟᱨ ᱵᱟᱝ ᱫᱟᱱᱟᱝ ᱥᱟᱵᱟᱫ ᱞᱟᱜᱟᱣᱢᱮ ᱟᱢᱟᱜ ᱥᱟᱸᱪᱟᱣ ᱞᱚᱜᱤᱱ ᱠᱚ ᱮᱢᱟᱱ ᱨᱩᱠᱷᱭᱟ ᱞᱟᱹᱜᱤᱫ ᱡᱩᱫᱤ ᱚᱞᱜᱟ ᱦᱚᱲ ᱴᱷᱮᱱ ᱟᱢᱟᱜ ᱥᱟᱫᱷᱚᱱ ᱛᱟᱦᱮᱸᱱ ᱠᱷᱟᱱ ᱾

source: Set up now
sat: ᱱᱤᱛᱚᱜ ᱥᱟᱡᱟᱣ ᱢᱮ

source: Share
sat: ᱦᱟᱹᱴᱤᱧ ᱢᱮ

source: Share a link
sat: ᱢᱤᱫ ᱴᱟᱝ ᱞᱤᱸᱠ ᱦᱟᱹᱴᱤᱧ ᱢᱮ

source: Share all tabs
sat: ᱡᱷᱚᱛᱚ ᱴᱮᱵ ᱠᱚ ᱦᱟᱹᱴᱧ ᱢᱮ

source: Share email address
sat: ᱤᱼᱢᱮᱞ ᱴᱷᱤᱠᱬᱟᱹ ᱠᱚ ᱦᱟᱹᱴᱤᱧ ᱢᱮ

source: Share image
sat: ᱪᱤᱛᱟᱹᱨ ᱦᱟᱹᱴᱤᱧ ᱢᱮ

source: Share link
sat: ᱞᱤᱸᱠ ᱦᱟᱹᱴᱤᱧ ᱢᱮ

source: Shares data about what features you use in %1$s with Leanplum, our mobile marketing vendor.
sat: Leanplum ᱚᱠᱚᱭ ᱫᱚ ᱟᱞᱮᱭᱤᱡ ᱢᱚᱵᱟᱭᱤᱞ ᱢᱟᱨᱠᱮᱴᱤᱝ ᱣᱮᱱᱰᱚᱨ ᱠᱟᱱᱟᱭ ᱩᱱᱤ ᱥᱟᱞᱟᱜ %1$s ᱨᱮ ᱯᱷᱤᱪᱚᱨ ᱵᱟᱵᱚᱛ ᱵᱮᱵᱷᱟᱨᱚᱜ ᱠᱟᱱ ᱰᱟᱴᱟ ᱦᱟᱹᱴᱤᱧᱚᱜᱼᱟ ᱾

source: Share selected tabs
sat: ᱵᱟᱪᱷᱟᱣ ᱟᱠᱟᱱ ᱴᱮᱵᱽ ᱠᱚ ᱦᱟᱹᱴᱤᱧ ᱢᱮ

source: Share session
sat: ᱚᱠᱛᱚ ᱦᱟᱹᱴᱤᱧ ᱢᱮ

source: Shares performance, usage, hardware and customization data about your browser with Mozilla to help us make %1$s better
sat: ᱟᱢᱟᱜ ᱵᱨᱟᱣᱡᱟᱚᱨ ᱨᱮᱭᱟᱜ ᱠᱟᱹᱢᱤ, ᱭᱩᱥᱮᱡ, ᱦᱟᱰᱣᱮᱨ ᱟᱨ ᱠᱟᱹᱥᱴᱚᱢᱟᱭᱡᱮᱥᱚᱱ ᱰᱟᱴᱟ ᱠᱚ Mozilla ᱥᱟᱞᱟᱜ ᱦᱟᱹᱴᱤᱧᱚᱜ ᱠᱟᱱᱟ ᱚᱠᱟ ᱫᱚ %1$s ᱵᱮᱥ ᱛᱮᱭᱟᱜ ᱨᱮ ᱜᱚᱲᱚ ᱮᱢᱟᱭ

source: Share tab
sat: ᱴᱮᱵ ᱦᱟᱹᱴᱤᱸᱧ ᱢᱮ

source: Share tabs
sat: ᱴᱮᱵ ᱠᱚ ᱦᱟᱹᱴᱤᱧ ᱢᱮ

source: Share via
sat: ᱫᱟᱨᱟᱭ ᱛᱮ ᱦᱟᱹᱴᱤᱧ

source: Share with…
sat: ᱱᱚᱶᱟ ᱛᱮ ᱦᱟᱹᱴᱤᱧ ᱢᱮ...

source: %s health report
sat: %s ᱦᱚᱲᱢᱚ ᱠᱷᱚᱵᱚᱨ

source: Shortcut name
sat: ᱠᱷᱟᱴᱚᱢᱟᱪᱷᱟ ᱧᱩᱛᱩᱢ

source: Show clipboard suggestions
sat: ᱨᱮᱴᱚᱯᱵᱚᱰ ᱦᱩᱫᱤᱥ ᱠᱚ ᱩᱫᱩᱜ

source: Show full history
sat: ᱥᱟᱱᱟᱢ ᱦᱤᱛᱟᱹᱞ ᱫᱮᱠᱷᱟᱣᱢᱮ

source: Show in private sessions
sat: ᱱᱤᱡᱮᱨᱟᱜ ᱚᱠᱛᱚ ᱨᱮ ᱩᱫᱩᱜ ᱢᱮ

source: Show most visited sites
sat: ᱡᱟᱹᱥᱛᱤ ᱦᱤᱨᱤ ᱟᱠᱟᱱ ᱥᱟᱭᱤᱴ ᱫᱮᱠᱷᱟᱣᱢᱮ

source: Show password
sat: ᱫᱟᱱᱟᱝ ᱥᱟᱵᱟᱫ ᱫᱮᱠᱷᱟᱣ

source: Show search engines
sat: ᱥᱮᱸᱫᱽᱨᱟ ᱤᱱᱡᱤᱱ ᱠᱚ ᱩᱫᱩᱜ ᱢᱮ

source: Show search suggestions
sat: ᱥᱮᱸᱫᱽᱨᱟ ᱦᱩᱫᱤᱥ ᱠᱚ ᱩᱫᱩᱜ

source: Show voice search
sat: ᱨᱚᱲ ᱥᱮᱸᱫᱽᱨᱟ ᱩᱫᱩᱜ

source: Sign in
sat: ᱵᱚᱞᱚᱱ ᱥᱩᱦᱤ

source: Signing in…
sat: ᱵᱚᱞᱚᱱᱟ ᱠᱟᱹᱱᱟᱹᱧ…

source: Sign in to Firefox
sat: Firefox ᱨᱮ ᱵᱚᱞᱚᱱ ᱥᱩᱦᱤ ᱢᱮ

source: Sign In to Firefox
sat: Firefox ᱛᱮ ᱵᱚᱞᱚᱱ ᱢᱮ

source: Sign in to reconnect
sat: ᱫᱩᱲᱟᱹ ᱡᱚᱲᱟᱣ ᱞᱟᱹᱜᱤᱛ ᱛᱮ ᱵᱚᱞᱚᱱ ᱥᱩᱦᱤ ᱢᱮ

source: Sign in to see synced bookmarks
sat: ᱥᱭᱸᱠᱼᱰ ᱵᱩᱠᱢᱟᱨᱠ ᱠᱚ ᱧᱮᱞ ᱞᱟᱹᱜᱤᱫ ᱛᱮ ᱵᱚᱞᱚᱱ ᱥᱩᱦᱤ ᱢᱮ

source: Sign in to sync
sat: ᱛᱷᱟᱨ ᱞᱟᱹᱜᱤᱛ ᱵᱚᱞᱚᱱ ᱥᱩᱦᱤ ᱢᱮ

source: Sign in to Sync
sat: ᱛᱷᱟᱨ ᱞᱟᱹᱜᱤᱛ ᱵᱚᱞᱚᱱ ᱥᱩᱦᱤ ᱢᱮ

source: Sign in with your camera
sat: ᱟᱢᱟᱜ ᱠᱮᱢᱨᱟ ᱛᱮ ᱵᱚᱞᱚᱱ ᱥᱩᱦᱤ ᱢᱮ

source: Sign out
sat: ᱵᱟᱦᱨᱮ ᱚᱰᱚᱠ

source: Site
sat: ᱥᱟᱭᱤᱴ

source: Site copied to clipboard
sat: ᱥᱟᱭᱤᱴ ᱨᱮᱴᱚᱵᱼᱵᱚᱰ ᱨᱮ ᱱᱚᱠᱚᱞᱮᱱᱟ

source: Site information
sat: ᱥᱟᱭᱤᱴ ᱨᱮᱭᱟᱜ ᱠᱷᱚᱵᱚᱨ

source: Site notifications
sat: ᱥᱟᱭᱤᱴ ᱨᱮᱭᱟᱜ ᱤᱛᱞᱟᱭ ᱠᱚ

source: Site permissions
sat: ᱥᱟᱭᱤᱴ ᱨᱮᱭᱟᱜ ᱪᱷᱟᱹᱲ ᱠᱚ

source: Site removed
sat: ᱥᱟᱭᱤᱴ ᱚᱪᱚᱜ ᱦᱩᱭ ᱮᱱᱟ

source: Social Media Trackers
sat: ᱥᱟᱸᱣᱛᱟ ᱢᱤᱰᱤᱭᱟ ᱯᱟᱧᱡᱟ ᱫᱟᱱᱟᱲ ᱠᱚ

source: Some content has been blocked by the autoplay setting
sat: ᱟᱡ ᱛᱮ ᱮᱛᱦᱚᱵ ᱥᱟᱡᱟᱣ ᱠᱚ ᱠᱷᱟᱹᱛᱤᱨ ᱛᱮ ᱠᱤᱪᱷᱤ ᱡᱤᱱᱤᱥ ᱠᱚ ᱵᱞᱚᱠ ᱠᱟᱱᱟ

source: Sorry. %1$s can’t load that page.
sat: ᱤᱠᱟ. %1$s ᱚᱱᱟ ᱥᱟᱦᱴᱟ ᱵᱟᱭ ᱞᱟᱫᱮ ᱫᱟᱲᱮᱼᱜ ᱠᱟᱱᱟ ᱾

source: Sorry. %1$s had a problem and crashed.
sat: ᱤᱠᱟᱹ %1$s ᱥᱟᱶ ᱛᱮ ᱫᱤᱜᱫᱷᱟ ᱦᱚᱭ ᱱᱟ ᱟᱨ ᱨᱟᱹᱯᱩᱫᱮᱱᱟ ᱾

source: Sort logins menu
sat: ᱞᱚᱜᱤᱱ ᱢᱮᱱᱭᱩ ᱥᱟᱞᱟᱭ ᱢᱮ

source: %s | OSS Libraries
sat: %s | OSS ᱯᱩᱛᱷᱤ ᱚᱲᱟᱜ

source: Speak now
sat: ᱱᱤᱛᱚᱜ ᱨᱚᱲ ᱢᱮ

source: %s (Private)
sat: %s (ᱱᱤᱡᱮᱨᱟᱜ)

source: Standard (default)
sat: ᱵᱮᱥᱟᱜ (ᱢᱩᱞ ᱯᱷᱮᱲᱟᱛ)

source: Start browsing
sat: ᱵᱨᱟᱩᱡᱤᱝ ᱮᱦᱚᱵᱽ ᱢᱮ

source: Start %s
sat: %s ᱮᱛᱦᱚᱵ ᱢᱮ

source: Start syncing bookmarks, passwords, and more with your Firefox account.
sat: ᱵᱩᱠᱢᱟᱨᱠ, ᱫᱟᱱᱟᱝ ᱥᱟᱵᱟᱫ ᱟᱨ ᱵᱟᱹᱲᱛᱤ ᱠᱚ ᱞᱟᱹᱜᱤᱛ ᱟᱢᱟᱜ Firefox ᱠᱷᱟᱛᱟ ᱨᱮ ᱥᱭᱸᱠ ᱮᱦᱚᱵᱽ ᱢᱮ ᱾

source: Status:
sat: ᱫᱚᱥᱟ:

source: Stay
sat: ᱛᱟᱦᱮᱸᱱ ᱢᱮ

source: Stay signed out
sat: ᱵᱟᱦᱨᱮ ᱨᱮᱜᱮ ᱛᱟᱦᱮᱸ ᱠᱚᱜ ᱢᱮ

source: Stop
sat: ᱛᱤᱸᱜᱩ

source: Stops outside ads, videos, and other content from loading that contains tracking code. May affect some website functionality.
sat: ᱵᱟᱦᱨᱮ ᱮᱰ, ᱣᱤᱰᱤᱭᱚ, ᱟᱨ ᱚᱞᱜᱟ ᱡᱤᱱᱤᱥ ᱠᱚ ᱮᱢᱟᱱ ᱜᱷᱮᱨ ᱮᱥᱮᱫ ᱠᱳᱰ ᱠᱚ ᱞᱟᱹᱜᱤᱫᱽ ᱵᱟᱭ ᱞᱟᱫᱮ ᱪᱷᱚᱭ ᱟ ᱾ ᱚᱞᱜᱟ ᱣᱮᱵᱥᱟᱭᱤᱴ ᱠᱟᱹᱢᱤ ᱠᱚ ᱨᱮᱭᱟᱜ ᱫᱷᱚᱸᱜ ᱠᱚᱫᱚᱞ ᱫᱟᱲᱮᱭᱟᱜᱼᱟᱭ ᱾

source: Stops uniquely identifiable data from being collected about your device that can be used for tracking purposes.
sat: ᱜᱷᱮᱨ ᱮᱥᱮᱫ ᱠᱟᱹᱢᱤ ᱠᱚ ᱞᱟᱹᱜᱤᱫᱽ ᱥᱟᱫᱷᱚᱱ ᱨᱮᱭᱟᱜ ᱱᱟᱶᱟ ᱰᱟᱴᱟ ᱠᱚ ᱮᱢᱟᱱ ᱡᱟᱣᱨᱟ ᱠᱚ ᱵᱚᱸᱫᱚᱭᱟ ᱾

source: Store unlimited amount of client-side data
sat: ᱟᱸᱱᱞᱭᱴᱮᱰ ᱠᱞᱟᱭᱮᱸᱴ ᱰᱟᱴᱟ ᱫᱚᱦᱚᱭ ᱢᱮ

source: Strict
sat: ᱱᱤᱦᱟᱹᱛ

source: Strict (recommended)
sat: ᱱᱤᱦᱟᱹᱛ (ᱵᱟᱛᱟᱣᱮᱢᱠᱟᱱᱟ)

source: Studies
sat: ᱯᱟᱲᱦᱟᱣ ᱠᱚ

source: Successfully disabled %1$s
sat: %1$s ᱨᱟᱹᱥ ᱞᱮᱠᱟᱛᱮ ᱵᱚᱸᱫᱚᱭᱮᱱᱟ

source: Successfully enabled %1$s
sat: %1$s ᱵᱮᱥ ᱛᱮ ᱮᱢ ᱪᱷᱚ

source: Successfully installed %1$s
sat: %1$s ᱨᱟᱹᱥ ᱞᱮᱠᱟᱛᱮ ᱵᱚᱦᱟᱞᱮᱱᱟ

source: Successfully removed %1$s
sat: %1$s ᱨᱟᱹᱥ ᱞᱮᱠᱟᱛᱮ ᱚᱪᱚᱜ ᱦᱚᱭᱮᱱᱟ

source: Successfully uninstalled %1$s
sat: %1$s ᱨᱟᱹᱥ ᱞᱮᱠᱟᱛᱮ ᱵᱚᱦᱟᱞ ᱚᱪᱚᱜᱮᱱᱟ

source: Successfully updated
sat: ᱨᱟᱹᱥ ᱞᱮᱠᱟᱛᱮ ᱦᱟᱹᱞᱤᱭᱟᱜᱮᱱᱟ

source: Suggested logins
sat: ᱵᱟᱛᱟᱣᱟᱠᱟᱱ ᱞᱚᱜᱤᱱ ᱠᱚ

source: Support
sat: ᱜᱚᱲᱚ

source: Supported add-ons checker
sat: ᱥᱟᱹᱯᱯᱚᱨᱴᱼᱟᱜ ᱮᱰᱰᱼᱚᱱᱥ ᱧᱮᱞᱤᱡ

source: %s will delete the selected browsing data.
sat: %s ᱵᱟᱪᱷᱟᱣᱟᱜ ᱵᱨᱟᱩᱡᱤᱝ ᱰᱟᱴᱟ ᱢᱮᱴᱟᱣ ᱟᱭ ᱾

source: %s will delete the selected items.
sat: %s ᱵᱟᱪᱷᱟᱣᱠᱟᱱ ᱡᱤᱱᱤᱥ ᱠᱚ ᱢᱮᱴᱟᱣ ᱟᱭ ᱾

source: %s will share everything you type in the address bar with your default search engine.
sat: ᱟᱢᱟᱜ ᱢᱩᱞ ᱥᱟᱸᱽᱨᱟ ᱤᱱᱡᱤᱱ ᱨᱮᱭᱟᱜ ᱴᱷᱤᱠᱬᱟ ᱵᱟᱨ ᱨᱮ ᱡᱟᱦᱟᱸ ᱜᱮ ᱚᱞᱟᱢ ᱚᱱᱟ ᱠᱚ %s ᱡᱷᱚᱛᱚ ᱦᱟᱹᱴᱤᱧᱟᱭ ᱾

source: %s will stop syncing with your account, but won’t delete any of your browsing data on this device.
sat: %s ᱫᱚ ᱟᱢᱟᱜ ᱠᱷᱟᱛᱟ ᱥᱟᱞᱟᱜ ᱥᱭᱸᱠ ᱵᱚᱸᱫᱽᱚᱭ ᱟ , ᱦᱮᱞᱮ ᱟᱢᱟᱜ ᱚᱠᱟ ᱵᱨᱟᱩᱡᱤᱸᱝ ᱰᱟᱴᱟ ᱦᱚᱸ ᱟᱢᱟᱜ ᱥᱟᱫᱷᱚᱱ ᱨᱮ ᱵᱟᱭ ᱢᱮᱴᱟᱣᱜᱼᱟ ᱾

source: Swipe toolbar sideways to switch tabs
sat: ᱴᱮᱵ ᱠᱚ ᱵᱚᱫᱚᱞ‌ ᱞᱟᱹᱜᱤᱫ ᱥᱟᱭᱤᱰ ᱛᱮᱴᱩᱞᱵᱟᱨ ᱠᱷᱚᱥᱨᱚᱫ ᱢᱮ

source: Swipe toolbar up to open tabs
sat: ᱴᱮᱵ ᱠᱚ ᱠᱷᱩᱞᱟᱹ ᱞᱟᱹᱜᱤᱫ ᱴᱩᱞᱵᱟᱨ ᱥᱣᱟᱭᱤᱯ ᱢᱮ

source: Switch
sat: ᱵᱚᱫᱚᱞ ᱢᱮ

source: Switch to tab
sat: ᱴᱮᱵ ᱨᱮ ᱩᱪᱟᱹᱲᱚᱜ ᱢᱮ

source: Switch to the new Nightly
sat: ᱱᱟᱶᱟ Nightly ᱛᱮ ᱩᱪᱟᱹᱰᱼᱚᱜ ᱢᱮ

source: Sync bookmarks, history, and more with your Firefox Account
sat: ᱵᱩᱠᱢᱟᱨᱠ, ᱦᱤᱛᱟᱹᱞ ᱟᱨ ᱵᱟᱹᱲᱛᱤ ᱠᱚ ᱟᱢᱟᱜ Firefox ᱠᱷᱟᱛᱟ ᱥᱟᱶ ᱛᱮ ᱥᱭᱸᱠ ᱢᱮ

source: Synced tabs
sat: ᱥᱭᱸᱠᱼᱰ ᱴᱮᱵ ᱠᱚ

source: Sync failed. Last success: %s
sat: ᱥᱭᱸᱠ ᱰᱤᱜᱟᱹᱣ ᱾ ᱢᱟᱲᱟᱝ ᱨᱟᱹᱥ ᱞᱮᱠᱟᱛᱮ ᱪᱟᱵᱟ:%s

source: Sync failed. Last synced: never
sat: ᱥᱭᱸᱠ ᱰᱤᱜᱟᱹᱣ ᱾ ᱢᱟᱲᱟᱝ ᱥᱭᱸᱠᱼᱰ:ᱛᱤᱥ ᱦᱚᱸ ᱵᱟᱝᱼᱟ

source: Sync Firefox between devices with an account.
sat: ᱢᱤᱫᱽᱴᱟᱹᱝ ᱠᱷᱟᱛᱟ ᱛᱮ ᱥᱟᱫᱽᱷᱚᱱ ᱵᱷᱤᱛᱨᱭ ᱨᱮ Firefox ᱥᱭᱸᱠ ᱢᱮ ᱾

source: Syncing…
sat: ᱥᱤᱸᱠ ᱦᱩᱭᱩ ᱠᱟᱱᱟ...

source: Sync is on
sat: ᱥᱭᱸᱠ ᱪᱟᱹᱞᱩ ᱢᱮᱱᱟᱜ-ᱟ

source: Sync logins
sat: ᱞᱚᱜᱤᱱ ᱠᱚ ᱥᱤᱸᱠ ᱢᱮ

source: Sync now
sat: ᱱᱤᱛᱚᱜ ᱥᱭᱸᱠ ᱢᱮ

source: Tab closed
sat: ᱴᱮᱵ ᱵᱚᱸᱫᱚᱭᱮᱱᱟ

source: Tab deleted
sat: ᱴᱮᱵ ᱢᱮᱴᱟᱣᱮᱱᱟ

source: Tab from %s
sat: %s ᱠᱷᱚᱱ ᱴᱮᱵ

source: Tab menu
sat: ᱴᱮᱵ ᱢᱮᱱᱭᱩ

source: Tab Received
sat: ᱴᱮᱵ ᱧᱟᱢᱮᱱᱟ

source: Tabs
sat: ᱴᱮᱵ ᱠᱚ

source: Tab saved!
sat: ᱴᱮᱵ ᱥᱟᱸᱪᱟᱣᱮᱱᱟ!

source: Tabs closed
sat: ᱴᱮᱵ ᱠᱚ ᱵᱚᱸᱫᱚᱭᱮᱱᱟ

source: Tabs closed!
sat: ᱴᱮᱵ ᱠᱚ ᱵᱚᱸᱫᱽ ᱮᱱᱟ!

source: Tabs deleted
sat: ᱴᱮᱵ ᱠᱚ ᱢᱮᱴᱟᱣᱮᱱᱟ

source: Tab sent!
sat: ᱴᱮᱵ ᱠᱩᱞ ᱦᱩᱭᱮᱱᱟ!

source: Tab settings
sat: ᱴᱮᱵ ᱨᱮᱭᱟᱜ ᱥᱟᱡᱟᱣ ᱠᱚ

source: Tabs Received
sat: ᱴᱮᱵ ᱠᱚ ᱧᱟᱢᱮᱱᱟ

source: Tabs saved!
sat: ᱴᱮᱵ ᱠᱚ ᱥᱟᱸᱪᱟᱣᱮᱱᱟ!

source: Tabs sent!
sat: ᱴᱮᱵ ᱠᱚ ᱠᱩᱞ ᱦᱩᱭᱮᱱᱟ!

source: Tab view
sat: ᱴᱮᱵ ᱧᱮᱞ

source: Take a position
sat: ᱡᱟᱭᱜᱟ ᱦᱟᱛᱟᱣ ᱢᱮ

source: Tap to copy the URL for this app
sat: ᱱᱚᱶᱟ ᱮᱯ ᱨᱮᱭᱟᱜ URL ᱱᱚᱠᱚᱞ ᱞᱟᱹᱜᱤᱛ ᱛᱮ ᱡᱚᱴᱮᱫ ᱢᱮ

source: Telemetry
sat: ᱴᱮᱞᱭᱢᱮᱴᱨᱭ

source: The address isn’t valid
sat: ᱴᱷᱤᱠᱬᱟᱹ ᱵᱟᱭ ᱴᱷᱤᱠ ᱟ

source: The connection has timed out
sat: ᱡᱚᱯᱚᱲᱟᱣ ᱚᱠᱛᱚ ᱪᱟᱵᱟ ᱮᱱᱟ

source: The connection was interrupted
sat: ᱡᱚᱲᱟᱣ ᱵᱟᱝ ᱧᱮᱞ ᱞᱮᱱᱟ

source: The connection was reset
sat: ᱡᱚᱱᱚᱲᱟᱹᱣ ᱫᱚ ᱨᱤᱥᱮᱴ ᱮᱱᱟ

source: The editable text field for the password of the login.
sat: ᱫᱟᱱᱟᱝ ᱥᱟᱵᱟᱫ ᱞᱚᱜᱤᱱ ᱞᱟᱹᱜᱤᱫ ᱥᱟᱯᱲᱟᱣ ᱚᱞ ᱡᱟᱭᱜᱟ ᱾

source: The editable text field for the username of the login.
sat: ᱵᱮᱵᱷᱟᱨᱤᱭᱟᱹ ᱞᱚᱜᱤᱱ ᱞᱟᱹᱜᱤᱫ ᱥᱟᱯᱲᱟᱣ ᱚᱞ ᱡᱟᱭᱜᱟ ᱾

source: The editable text field for the web address of the login.
sat: ᱣᱤᱵ ᱴᱷᱤᱠᱬᱟᱹ ᱞᱚᱜᱤᱱ ᱵᱚᱞᱚ ᱞᱟᱹᱜᱤᱫ ᱥᱟᱯᱲᱟᱣ ᱚᱞ ᱡᱟᱭᱜᱟ ᱾

source: The logins you save or sync to %s will show up here.
sat: ᱞᱚᱜᱤᱱ ᱚᱠᱟ %s ᱨᱮ ᱥᱟᱸᱪᱟᱣ ᱟᱨ ᱥᱭᱸᱠ ᱥᱟᱱᱟᱢ ᱠᱟᱱᱟ ᱚᱱᱟ ᱠᱚ ᱱᱚᱰᱮ ᱫᱮᱠᱷᱟᱣᱜᱼᱟ ᱾

source: Theme
sat: ᱩᱭᱦᱟᱹᱨ

source: The page at %1$s says:
sat: %1$s ᱴᱷᱮᱱ ᱢᱮᱱᱟᱜ ᱥᱟᱦᱴᱟ ᱢᱮᱱᱮᱜᱼᱟᱭ:

source: The page isn’t redirecting properly
sat: ᱥᱟᱦᱴᱟ ᱵᱮᱥ ᱞᱮᱠᱟᱛᱮ ᱵᱟᱭ ᱪᱟᱞᱟᱣ ᱨᱩᱣᱟᱹᱲ ᱠᱟᱱᱟ

source: The tab counter toolbar button.
sat: ᱴᱮᱵ ᱠᱟᱩᱱᱴᱟᱹᱨ ᱴᱩᱞᱵᱟᱨ ᱵᱩᱛᱟᱹᱢ ᱾

source: This add-on was migrated from a previous version of %1$s
sat: ᱱᱚᱶᱟ ᱮᱰᱰᱼᱚᱱ ᱫᱚ ᱢᱟᱲᱟᱝ ᱦᱟᱹᱞᱤᱭᱟᱠ %1$s ᱠᱷᱚᱱ ᱩᱪᱟᱹᱲ ᱠᱟᱱᱟ

source: This app will no longer receive security updates. Get the new Nightly and stop using this app. \n\nTo transfer your bookmarks, logins, and history to another app, create a Firefox account.
sat: ᱱᱚᱶᱟ ᱮᱯᱯ ᱫᱚ ᱟᱨ ᱨᱩᱠᱷᱤᱭᱟᱹ ᱟᱹᱯᱰᱮᱴ ᱵᱟᱭ ᱧᱟᱢᱟᱭ ᱾ ᱱᱟᱶᱟ Nightly ᱵᱮᱵᱷᱟᱨ ᱢᱮ ᱟᱨ ᱮᱯᱯ ᱵᱮᱵᱷᱟᱨ ᱵᱚᱸᱫᱽᱚᱭ ᱢᱮ ᱾ \n\nᱵᱩᱻᱠᱢᱟᱨᱠ, ᱞᱚᱜᱤᱱ ᱟᱨ ᱱᱟᱜᱟᱢ ᱠᱚ ᱚᱞᱜᱟ ᱮᱯᱯ ᱛᱮ ᱩᱪᱟᱹᱲ ᱞᱟᱹᱜᱤᱫᱽ ᱱᱟᱶᱟ Firefox ᱠᱷᱟᱛᱟ ᱛᱮᱭᱟᱨ ᱢᱮ ᱾

source: This app will no longer receive security updates. Stop using this app and switch to the new Nightly. \n\nTo transfer your bookmarks, logins, and history to another app, create a Firefox account.
sat: ᱱᱚᱶᱟ ᱮᱯᱯ ᱫᱟ ᱥᱮᱠᱭᱚᱨᱤᱴᱭ ᱟᱹᱯᱰᱮᱴᱠᱚ ᱵᱟᱭ ᱧᱟᱢᱟᱭ ᱾ ᱮᱯᱯ ᱵᱮᱵᱷᱟᱨ ᱵᱚᱸᱫᱚᱭ ᱯᱮ ᱟᱨ ᱱᱟᱶᱟ Nighty ᱛᱮ ᱪᱟᱞᱟᱜ ᱢᱮ ᱾ \n\nᱟᱢᱟᱜᱽ ᱵᱩᱻᱠᱢᱟᱨᱠᱠᱚ, ᱵᱚᱞᱚᱠᱚ, ᱟᱨ ᱱᱟᱜᱟᱢ ᱚᱠᱜᱟ ᱮᱯᱯ ᱛᱮ ᱩᱪᱟᱹᱲ ᱞᱟᱹᱜᱤᱫᱽ, ᱱᱟᱶᱟ Firefox ᱠᱷᱟᱛᱟ ᱛᱮᱭᱟᱨ ᱢᱮ ᱾

source: This connection is not secure. Logins entered here could be compromised.
sat: ᱱᱚᱶᱟ ᱡᱩᱲᱟᱹᱣ ᱫᱚ ᱵᱟᱝ ᱴᱷᱤᱠ ᱟ ᱾ ᱞᱚᱜᱤᱱ ᱨᱮ ᱚᱞ ᱮᱢ ᱡᱤᱱᱤᱥ ᱫᱚ ᱠᱚᱢᱯᱨᱚᱢᱟᱭᱤᱡ ᱫᱟᱲᱮᱟᱜᱼᱟ ᱾

source: This is sample text. It is here to show how text will appear when you increase or decrease the size with this setting.
sat: ᱱᱚᱶᱟ ᱫᱚ ᱡᱮᱢᱚᱱ ᱟᱲᱟ ᱠᱟᱱᱟ ᱾ ᱱᱚᱶᱟ ᱫᱚ ᱥᱟᱡᱟᱣ ᱵᱚᱫᱚᱞ ᱠᱚ ᱫᱮᱠᱷᱟᱣ ᱞᱟᱹᱜᱤᱫ ᱠᱟᱱᱟ ᱚᱠᱟᱞᱠᱟᱛᱮ ᱟᱲᱟ ᱞᱚ ᱢᱟᱨᱟᱝ ᱟᱨ ᱵᱟᱝ ᱠᱟᱹᱴᱤᱡ ᱞᱮᱠᱷᱟᱱ ᱚᱠᱟᱞᱠᱟ ᱧᱮᱞᱚᱜᱼᱟ ᱾

source: This time, search with:
sat: ᱱᱤᱭᱟᱹ ᱫᱷᱟᱣ, ᱱᱚᱶᱟ ᱛᱮ ᱥᱮᱸᱫᱽᱨᱟᱭ ᱢᱮᱺ

source: This will delete all of your browsing data.
sat: ᱱᱚᱶᱟ ᱫᱚ ᱟᱢᱟᱜ ᱥᱟᱱᱟᱢ ᱵᱨᱟᱩᱡᱤᱝ ᱰᱟᱴᱟ ᱢᱮᱴᱟᱣ ᱛᱟᱢᱟᱭ ᱾

source: To add a new top site, remove one. Touch and hold the site and select remove.
sat: ᱱᱟᱶᱟ ᱴᱟᱹᱯ ᱥᱟᱭᱤᱴ ᱥᱮᱞᱮᱫᱽ ᱞᱟᱹᱜᱤᱫ, ᱢᱤᱫᱴᱟᱹᱝ ᱚᱰᱚᱠ ᱢᱮ ᱾ ᱥᱟᱭᱤᱴ ᱴᱤᱯᱟᱹᱣ ᱟᱨ ᱚᱛᱟ ᱛᱷᱤᱨ ᱠᱟᱛᱮ ᱵᱟᱪᱷᱟᱣ ᱢᱮ ᱟᱨ ᱚᱰᱚᱠ ᱢᱮ ᱾

source: To allow it:
sat: ᱦᱮᱥᱟᱨᱤᱭᱟᱹ ᱮᱢ ᱞᱟᱹᱜᱤᱫ ᱛᱮ:

source: Today
sat: ᱛᱮᱦᱮᱸᱧ

source: Toggle tab mode
sat: ᱴᱮᱵ ᱢᱳᱰ ᱛᱚᱞᱟᱜ ᱢᱮ

source: Toolbar
sat: ᱴᱩᱞᱵᱟᱨ

source: Top
sat: ᱪᱮᱛᱟᱱ

source: Top Articles
sat: ᱵᱮᱥ ᱚᱱᱚᱞ ᱠᱚ

source: Top site limit reached
sat: ᱴᱚᱯ ᱥᱟᱭᱤᱴ ᱞᱤᱢᱤᱴ ᱥᱮᱴᱮᱨᱮᱱᱟ

source: Top site name
sat: ᱴᱳᱯ ᱥᱟᱭᱤᱴ ᱧᱩᱛᱩᱢ

source: Top sites
sat: ᱪᱮᱛᱟᱱ ᱨᱤᱱ ᱥᱟᱭᱤᱴ ᱠᱚ

source: To send a tab, sign in to Firefox on at least one other device.
sat: ᱴᱮᱵ ᱵᱷᱮᱡᱟ ᱞᱟᱹᱜᱤᱫ, ᱢᱤᱫ ᱠᱷᱚᱱ ᱡᱟᱹᱥᱛᱤ ᱥᱟᱫᱷᱚᱱ ᱛᱮ Firefox ᱨᱮ ᱵᱚᱞᱚᱱ ᱢᱮ ᱾

source: Tracking content
sat: ᱯᱟᱧᱡᱟ ᱫᱟᱱᱟᱲ ᱡᱤᱱᱤᱥ

source: Tracking Content
sat: ᱯᱟᱧᱡᱟ ᱫᱟᱱᱟᱲ ᱡᱤᱱᱤᱥ

source: Tracking Protection
sat: ᱯᱟᱸᱡᱟ ᱨᱚᱯᱷᱟ

source: Tracking Protection has blocked trackers
sat: ᱯᱟᱸᱡᱟ ᱨᱚᱯᱷᱟ ᱯᱟᱧᱡᱟ ᱫᱟᱱᱟᱲ ᱠᱚ ᱟᱠᱚᱴ ᱠᱮᱜᱼᱟᱭ

source: Tracking Protection is off for these websites
sat: ᱯᱟᱸᱡᱟ ᱨᱚᱯᱷᱟ ᱱᱚᱶᱟ ᱠᱚ ᱣᱮᱵᱥᱟᱭᱤᱴ ᱞᱟᱹᱜᱤᱛ ᱛᱮ ᱵᱚᱸᱫᱚ ᱢᱮᱱᱟᱜ-ᱟ

source: Tracking Protection is off for this site
sat: ᱯᱟᱸᱡᱟ ᱨᱚᱯᱷᱟ ᱵᱚᱸᱫᱚ ᱢᱮᱱᱟᱜ-ᱟ

source: Tracking Protection is on
sat: ᱯᱟᱸᱡᱟ ᱟᱰ ᱪᱟᱹᱞᱩ ᱢᱮᱱᱟᱜ-ᱟ

source: Translation not found, for locale %1$s neither default language %2$s
sat: %1$s ᱞᱟᱹᱜᱤᱫ ᱛᱚᱨᱡᱚᱢᱟ ᱥᱟᱶ ᱢᱩᱞ ᱯᱟᱹᱨᱥᱤ %2$s ᱵᱟᱭ ᱧᱟᱢ ᱞᱟᱱᱟ

source: Try Again
sat: ᱫᱚᱦᱲᱟᱹ ᱪᱮᱥᱴᱟᱭ ᱢᱮ

source: Try one-handed browsing with the bottom toolbar or move it to the top.
sat: ᱞᱟᱛᱟᱨ ᱴᱩᱞᱵᱟᱨ ᱥᱟᱞᱟᱜ ᱢᱤᱫ ᱛᱤ ᱵᱨᱟᱣᱡᱤᱝ ᱥᱟᱞᱟᱜ ᱪᱮᱛᱟᱱ ᱥᱮᱱ ᱨᱟᱠᱟᱵ ᱨᱮᱭᱟᱜ ᱪᱮᱥᱴᱟᱭ ᱢᱮ ᱾

source: Turned off globally, go to Settings to turn it on.
sat: ᱡᱮᱜᱮᱛ ᱨᱮ ᱵᱚᱸᱫᱚ ᱦᱩᱭ ᱠᱟᱱᱟ, ᱪᱟᱹᱞᱩ ᱞᱟᱹᱜᱤᱫ ᱛᱮ ᱥᱟᱡᱟᱣ ᱨᱮ ᱪᱟᱹᱞᱩᱭ ᱢᱮ ᱾

source: Turn on for all sites
sat: ᱡᱷᱚᱛᱚ ᱠᱚ ᱥᱟᱭᱤᱴ ᱞᱟᱹᱜᱤᱛ ᱛᱮ ᱚᱱ ᱢᱮ

source: Turn on Sync
sat: ᱥᱭᱸᱠ ᱪᱟᱹᱞᱩᱭ ᱢᱮ

source: <ul> <li>Could the item have been renamed, removed, or relocated?</li> <li>Is there a spelling, capitalization, or other typographical error in the address?</li> <li>Do you have sufficient access permissions to the requested item?</li> </ul>
sat: ¶•<ul>¶•<li>ᱪᱮᱫ ᱟᱭᱴᱚᱢ ᱫᱚᱦᱲᱟ ᱛᱮ ᱧᱩᱛᱩᱢ ᱟᱹᱛᱩ ᱫᱟᱲᱮᱭᱟᱜ-ᱟ, ᱚᱪᱚᱫ, ᱥᱮ ᱫᱚᱦᱲᱟ ᱛᱷᱟᱯᱚᱱᱚᱜ-ᱟ?</li>¶•<li>ᱪᱮᱫ ᱮᱰᱨᱮᱥ ᱨᱮ ᱟᱹᱲ ᱠᱮᱯᱤᱴᱭᱞᱤᱡᱮᱥᱚᱱ, ᱥᱮ ᱮᱴᱟᱜ ᱴᱟᱭᱯᱳᱜᱽᱨᱟᱯᱷᱤᱠᱟᱞ ᱨᱮ ᱦᱩᱲᱟᱹᱜ ᱢᱮᱱᱟᱜ-ᱟ?</li>¶•<li> ᱪᱮᱫ ᱟᱢ ᱴᱷᱮᱱ ᱫᱟᱣ ᱮᱢ ᱞᱟᱹᱜᱤᱫ ᱥᱟᱳᱷᱤᱥᱤᱭᱚᱱᱴ ᱯᱚᱨᱢᱤᱥᱚᱱ ᱢᱮᱱᱟᱜ-ᱟ? </li>¶•</ul>¶•

source: <ul> <li>It may have been removed, moved, or file permissions may be preventing access.</li> </ul>
sat: <ul> <li>ᱱᱚᱶᱟ ᱫᱚ ᱚᱰᱚᱠ, ᱩᱪᱟᱹᱲ, ᱟᱨ ᱵᱟᱝ ᱨᱮᱫ ᱨᱮᱭᱟᱜ ᱟᱹᱱᱩᱢᱟᱫᱛᱤ ᱠᱚ ᱠᱷᱟᱹᱛᱤᱨ ᱦᱩᱭ ᱠᱚᱜᱼᱟ ᱾</li> </ul>

source: <ul> <li>Please contact the website owners to inform them of this problem.</li> </ul>
sat: <ul> <li>ᱫᱚᱭᱟᱠᱟᱛᱮ ᱣᱮᱵᱥᱟᱭᱤᱴ ᱢᱟᱞᱤᱠ ᱡᱩᱜᱟᱡᱩᱜ ᱮᱢ ᱟᱨ ᱦᱩᱲᱟᱹᱜ ᱵᱤᱥᱚᱭ ᱨᱮ ᱠᱷᱚᱵᱚᱨ ᱮᱢᱟ ᱠᱚᱢ</li> </ul>

source: <ul> <li>The page you are trying to view cannot be shown because the authenticity of the received data could not be verified.</li> <li>Please contact the website owners to inform them of this problem.</li> </ul>
sat: ¶•<ul>¶ • <li>ᱚᱠᱟ ᱥᱟᱦᱴᱟ ᱧᱮᱞ ᱞᱟᱹᱜᱤᱫ ᱠᱷᱚᱡᱚᱜ ᱠᱟᱱ ᱛᱟᱦᱮᱸᱡ ᱚᱱᱟ ᱫᱚ ᱰᱟᱴᱟ ᱨᱮᱭᱟᱜ ᱚᱛᱷᱮᱱᱴᱤᱥᱤᱴᱭ ᱫᱚ ᱵᱟᱝ ᱯᱩᱥᱴᱟᱹᱣ ᱫᱟᱲᱮᱞᱟᱱᱟ ᱾</li> <li>ᱫᱚᱭᱟᱠᱟᱛᱮ ᱣᱮᱵᱥᱟᱭᱤᱴ ᱢᱟᱞᱤᱠ ᱡᱩᱜᱟᱡᱩᱜ ᱮᱢ ᱟᱨ ᱦᱩᱲᱟᱹᱜ ᱵᱟᱵᱚᱫᱽ ᱠᱷᱚᱵᱚᱨ ᱮᱢ ᱢᱮ ᱾</li>¶• </ul>•

source: <ul> <li>The site could be temporarily unavailable or too busy. Try again in a few moments.</li> <li>If you are unable to load any pages, check your device’s data or Wi-Fi connection.</li> </ul>
sat: <ul> <li>ᱥᱟᱭᱤᱴ ᱵᱮᱛᱷᱟᱱᱤᱠ ᱛᱟᱦᱮᱸ ᱠᱚᱜᱼᱟ ᱟᱨ ᱵᱟᱝ ᱡᱟᱹᱛᱤ ᱵᱤᱡᱭ ᱛᱟᱦᱮᱸ ᱠᱚᱜᱼᱟ ᱾ ᱠᱤᱪᱷᱤ ᱥᱚᱢᱚᱭ ᱯᱚᱨᱮ ᱫᱩᱦᱲᱟᱹ ᱪᱮᱥᱴᱟᱭ ᱢᱮ ᱾</li> <li>ᱟᱢ ᱡᱚᱫᱤ ᱥᱟᱦᱴᱟ ᱵᱟᱝ ᱞᱚᱰ ᱫᱟᱲᱮᱭᱟᱜ ᱠᱟᱱᱟᱢ, ᱥᱟᱢᱟᱜ ᱥᱟᱫᱷᱚᱱ ᱨᱮᱭᱟᱜ ᱰᱟᱴᱟ ᱟᱨ ᱵᱟᱝ Wi-Fi ᱡᱩᱲᱟᱹᱣ ᱧᱮᱞ ᱵᱤᱰᱟᱹᱣ ᱢᱮ ᱾</li> </ul>

source: <ul> <li>This could be a problem with the server’s configuration, or it could be someone trying to impersonate the server.</li> <li>If you have connected to this server successfully in the past, the error may be temporary, and you can try again later.</li> </ul>
sat: ¶ · <ul>¶ · <li>ᱱᱚᱶᱟ ᱥᱟᱨᱵᱷᱟᱨ ᱠᱚᱱᱯᱷᱤᱜᱽᱨᱮᱥᱚᱱ ᱥᱟᱶ ᱮᱴᱠᱮᱴᱚᱬᱮ ᱦᱩᱭ ᱫᱟᱲᱮᱭᱟᱜ-ᱟ, ᱥᱮ ᱱᱚᱶᱟ ᱡᱟᱦᱟᱸᱭ ᱦᱚᱛᱮᱛᱮ ᱤᱢᱯᱚᱨᱥᱳᱱᱮᱴ ᱨᱤᱠᱟᱹ ᱦᱩᱭ ᱫᱟᱲᱮᱭᱟᱜ-ᱟ ᱾ </li>¶•<li> ᱡᱩᱫᱤ ᱟᱢ ᱞᱟᱦᱟ ᱛᱮ ᱥᱟᱨᱵᱷᱟᱨ ᱥᱟᱶ ᱡᱚᱲᱟᱣ ᱢᱮᱱᱟᱜ ᱢᱮᱭᱟ, ᱤᱨᱳᱨ ᱛᱟᱦᱮᱸ ᱫᱟᱲᱮᱭᱟᱜ-ᱟ, ᱟᱨ ᱛᱟᱭᱚᱢ ᱛᱮᱢ ᱨᱤᱠᱟᱹ ᱫᱟᱲᱮᱭᱟᱜ-ᱟ ᱾</li>¶•</ul>¶•

source: <ul> <li>Web addresses are usually written like <strong>http://www.example.com/</strong></li> <li>Make sure that you’re using forward slashes (i.e. <strong>/</strong>).</li> </ul>
sat: <ul> <li>ᱣᱮᱵ ᱴᱷᱤᱠᱬᱟᱹ ᱫᱚ<strong>http://www.example.com/</strong>ᱠᱚ ᱚᱞᱟ</li> <li>ᱯᱷᱚᱨᱣᱟᱰ ᱥᱞᱟᱥ ᱮᱢ ᱟᱞᱚ ᱦᱤᱲᱤᱧᱟᱢ (ᱡᱮᱢᱚᱱ <strong>/</strong>).</li> </ul>

source: Unable to connect
sat: ᱵᱟᱝ ᱡᱩᱲᱟᱹᱣ ᱫᱟᱲᱮᱭᱟᱜ-ᱟ

source: Unable to connect. Unrecognizable URL scheme.
sat: ᱵᱟᱝ ᱡᱩᱲᱟᱹᱣ ᱫᱟᱲᱮᱭᱟᱜ ᱠᱟᱱᱟ ᱾ URL ᱥᱠᱤᱢ ᱵᱟᱝ ᱪᱤᱱᱦᱟᱹᱣ ᱫᱟᱲᱮᱞᱟᱱᱟ ᱾

source: Unable to open %1$s
sat: %1$s ᱵᱟᱝ ᱠᱷᱩᱞᱟᱹ ᱫᱟᱲᱮᱞᱟᱱᱟ

source: Unable to save login
sat: ᱞᱚᱜᱤᱱ ᱵᱟᱭ ᱥᱟᱸᱪᱟᱣ ᱫᱟᱲᱮᱭᱟᱜ ᱠᱟᱱᱟ

source: Unable to send
sat: ᱵᱟᱝ ᱠᱩᱞ ᱫᱟᱲᱮᱞᱟᱱᱟ

source: Undo
sat: ᱚᱱᱰᱩ

source: UNDO
sat: ᱚᱱᱰᱩ

source: Unexpected response from server
sat: ᱥᱟᱹᱨᱣᱟᱨ ᱠᱷᱚᱱ ᱵᱟᱝ ᱟᱸᱥ ᱨᱚᱲ ᱨᱩᱣᱟᱹᱲ

source: Unknown Protocol
sat: ᱵᱟᱝ ᱵᱟᱰᱟᱭ ᱯᱚᱨᱴᱟᱞ

source: Unlock %1$s
sat: %1$s ᱠᱷᱩᱞᱟᱹᱭ ᱢᱮ

source: Unlock to view your saved logins
sat: ᱥᱟᱸᱪᱟᱣᱠᱟᱱ ᱵᱚᱞᱚᱱ ᱥᱩᱦᱤ ᱠᱚ ᱧᱮᱞ ᱞᱟᱹᱜᱤᱛ ᱛᱮ ᱚᱱᱞᱚᱠ ᱢᱮ

source: Unlock your device
sat: ᱟᱢᱟᱜ ᱥᱟᱫᱷᱚᱱ ᱚᱱᱞᱚᱠ ᱢᱮ

source: Unsafe File Type
sat: ᱨᱮᱫ ᱯᱨᱚᱠᱟᱨ ᱵᱟᱝᱨᱟᱠᱷᱭᱟᱼᱟᱜ ᱠᱟᱱᱟ

source: Unselected %1$s
sat: ᱵᱟᱝ ᱵᱟᱪᱷᱟᱣᱟᱜ%1$s

source: Unwanted site issue
sat: ᱵᱮᱠᱷᱟᱛᱤᱨ ᱥᱟᱭᱤᱴ ᱤᱥᱥᱩ

source: Update
sat: ᱦᱟᱹᱞᱤᱭᱟᱹᱜ ᱢᱮ

source: Update complete
sat: ᱦᱟᱹᱞᱤᱭᱟᱜ ᱯᱩᱨᱟᱹᱣᱮᱱᱟ

source: Update in progress
sat: ᱦᱟᱹᱞᱤᱭᱟᱜ ᱞᱟᱦᱟᱜ ᱠᱟᱱᱟ

source: Updater Information
sat: ᱦᱟᱹᱞᱤᱭᱟᱜ ᱵᱟᱵᱚᱛ

source: Update this login?
sat: ᱱᱚᱶᱟ ᱞᱚᱜᱤᱱ ᱦᱟᱹᱞᱤᱭᱟᱜ ᱢᱮ?

source: Updating %s…
sat: %s ᱦᱟᱹᱞᱤᱭᱟᱼᱜ ᱠᱟᱱᱟ ...

source: URL copied
sat: URL ᱱᱚᱠᱚᱞ ᱮᱱᱟ

source: URL copied.
sat: URL ᱱᱚᱠᱚᱞᱮᱱᱟ ᱾

source: URL copied to clipboard
sat: URL ᱠᱞᱤᱯᱵᱳᱰ ᱨᱮ ᱱᱚᱠᱚᱞᱮᱱᱟ

source: Usage and technical data
sat: ᱵᱮᱵᱷᱟᱨ ᱟᱨ ᱴᱮᱠᱱᱤᱠᱚᱞ ᱰᱟᱴᱟ ᱠᱚ

source: Use email instead
sat: ᱵᱟᱹᱫᱟᱹᱞ ᱛᱮ ᱮᱢᱮᱞ ᱵᱮᱵᱷᱟᱨ ᱢᱮ

source: Username
sat: ᱵᱮᱵᱷᱟᱨᱤᱡᱟᱠ ᱭᱩᱛᱩᱢ

source: Username copied to clipboard
sat: ᱵᱮᱵᱷᱟᱨᱭᱤᱡ ᱧᱩᱛᱩᱢ ᱨᱮᱴᱚᱵᱼᱵᱚᱰ ᱨᱮ ᱱᱚᱠᱚᱞᱮᱱᱟ

source: Use your fingerprint to access configuring your required passcode interval.
sat: ᱟᱢᱟᱜ ᱯᱟᱥᱠᱳᱰ ᱵᱷᱤᱛᱨᱭ ᱛᱮᱭᱟᱨ ᱟᱫᱮᱨ ᱛᱟᱞᱟ ᱨᱮ ᱟᱢᱟᱜ ᱠᱟᱹᱴᱩᱵ ᱨᱮᱭᱟᱜ ᱵᱮᱵᱷᱟᱨ ᱢᱮ᱾

source: Verified By: %1$s
sat: ᱯᱚᱨᱢᱟᱱᱤᱡᱺ%1$s

source: Version
sat: ᱟᱨᱩᱯᱷᱮᱨᱟᱣ

source: View
sat: ᱧᱮᱞ

source: View a list of tabs from your other devices.
sat: ᱟᱢᱟᱜ ᱮᱴᱟᱜ ᱥᱟᱫᱷᱚᱱ ᱠᱷᱚᱱ ᱴᱮᱵ ᱞᱤᱥᱴᱤ ᱫᱮᱠᱷᱟᱣ ᱢᱮ ᱾

source: View options
sat: ᱮᱴᱟᱜᱟ ᱚᱯᱥᱚᱱ ᱠᱚ ᱫᱮᱠᱷᱟᱣᱢᱮ

source: Voice search
sat: ᱨᱚᱲ ᱥᱮᱸᱫᱽᱨᱟ

source: Website
sat: ᱣᱮᱵᱥᱟᱭᱤᱴ

source: Welcome to an all-new %s
sat: %s ᱡᱷᱚᱛᱚ ᱱᱟᱶᱟ ᱥᱟᱹᱜᱩᱱ ᱫᱟᱨᱟᱢ

source: Welcome to %s!
sat: %s ᱨᱮ ᱥᱟᱹᱜᱩᱱ ᱫᱟᱨᱟᱢ!

source: We‘re currently building support for an initial selection of Recommended Extensions.
sat: ᱟᱞᱮ ᱫᱚ ᱱᱤᱛᱚᱜ ᱮᱛᱦᱚᱵ ᱫᱚᱭᱚᱱ ᱠᱚ ᱨᱮᱭᱟᱜ ᱢᱮᱚᱠ ᱯᱟᱥᱱᱟᱣ ᱠᱚ ᱞᱟᱹᱜᱤᱫ ᱥᱟᱹᱯᱯᱚᱴ ᱞᱮ ᱛᱚᱭᱟᱨ ᱮᱜᱼᱟ ᱾

source: We’ve designed %s to give you control over what you share online and what you share with us.
sat: ᱟᱞᱮ %s ᱞᱮ ᱰᱤᱡᱟᱭᱤᱱ ᱟᱠᱟᱫᱼᱟ ᱚᱠᱟ ᱫᱚ ᱡᱟᱦᱟᱱᱟᱜ ᱠᱚ ᱚᱱᱞᱟᱭᱤᱱ ᱦᱟᱹᱴᱤᱧ ᱨᱮ ᱟᱨ ᱚᱠᱟ ᱠᱚ ᱟᱞᱮ ᱦᱟᱹᱤᱧ ᱟᱞᱮᱭᱟᱢ, ᱜᱚᱲᱚ ᱮᱢᱟᱭ ᱾

source: What’s blocked by custom tracking protection
sat: ᱠᱚᱥᱴᱚᱢ ᱜᱷᱮᱨ ᱮᱥᱮᱫ ᱯᱨᱚᱴᱮᱠᱥᱚᱱ ᱛᱮ ᱪᱮᱫ ᱵᱞᱚᱠ ᱟᱹᱠᱟᱱᱟ

source: What’s blocked by standard tracking protection
sat: ᱢᱩᱞ ᱜᱷᱮᱨ ᱮᱥᱮᱫ ᱨᱚᱠᱷᱭᱟ ᱫᱚ ᱪᱮᱫ ᱮ ᱵᱞᱚᱠ ᱪᱷᱚ ᱠᱮᱜᱼᱟᱭ

source: What’s blocked by strict tracking protection
sat: ᱴᱷᱤᱴ ᱜᱷᱮᱨ ᱮᱥᱮᱫ ᱨᱩᱠᱷᱭᱟ ᱫᱚ ᱪᱮᱫ ᱵᱞᱚᱠ ᱠᱮᱜᱼᱟᱭ

source: What’s New
sat: ᱪᱮᱫ ᱱᱟᱶᱟ ᱢᱮᱱᱟᱜ-ᱟ

source: What’s new in %s
sat: %s ᱨᱮ ᱪᱮᱫ ᱱᱟᱶᱟ ᱢᱮᱱᱟᱜᱼᱟ
